---
kind: method
id: M:Autodesk.Revit.DB.Form.IsProfileEdge(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/380d6918-e259-c5a2-4fa2-79602bc5830e.htm
---
# Autodesk.Revit.DB.Form.IsProfileEdge Method

**中文**: 对话框、窗口、窗体

Tell if an edge or curve is generated from a profile.

## Syntax (C#)
```csharp
public bool IsProfileEdge(
	Reference curveOrEdgeReference
)
```

## Parameters
- **curveOrEdgeReference** (`Autodesk.Revit.DB.Reference`) - The reference of the edge or curve to be checked.